---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.RoomTag
source: html/5ce67a65-7b75-92b0-6f3f-465f27916eb5.htm
---
# RoomTag Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.